{
  "data": [
    {
      "id": "1",
      "name": "iPhone 15 Pro Max",
      "category": "Smartphones",
      "price": 1499,
      "short_description": "The iPhone 15 Pro Max sets a new standard for smartphones with its A17 Bionic chip, delivering industry-leading performance and efficiency. It features a stunning 6.7-inch 120Hz OLED display for crystal-clear visuals and buttery-smooth scrolling.",
      "description": "The iPhone 15 Pro Max redefines premium smartphones with its cutting-edge technology and elegant design. Featuring Apple's revolutionary A17 Bionic chip, this device effortlessly handles multitasking, gaming, and AI-driven tasks while maintaining exceptional energy efficiency. The expansive 6.7-inch OLED display boasts a silky 120Hz refresh rate, making every interaction fluid and responsive. Photographers and videographers will adore the pro-grade triple-camera system, which introduces groundbreaking low-light performance and cinematic stabilization. Crafted from aerospace-grade titanium, it combines lightweight durability with a sophisticated aesthetic. Enhanced 5G connectivity and all-day battery life ensure you stay connected and productive, while the intuitive iOS ecosystem provides a seamless user experience. Perfect for tech enthusiasts and professionals alike.",
      "points": [
        "A17 Bionic chip for unmatched performance",
        "6.7-inch 120Hz OLED display",
        "Triple-camera system with enhanced low-light capabilities",
        "Aerospace-grade titanium build for durability",
        "Improved battery life and 5G support"
      ],
      "images": [
        "https://mcsolution.com.bd/wp-content/uploads/2024/06/Apple-iPhone-16-and-16-plus-black-price-in-Bangladesh-MC-Solution-BD.webp",
        "https://i.ibb.co.com/M54mbwr/blue-modern-smartphone-instagram-post-1.png",
        "https://assets.gadgetandgear.com/upload/media/iphone-16-pro-max-512gb-desert-titanium.jpeg",
        "https://assets.gadgetandgear.com/upload/media/iphone-16-pro-max-512gb-desert-titanium-2.jpeg",
        "https://assets.gadgetandgear.com/upload/media/iphone-16-pro-max-512gb-desert-titanium-3.jpeg",
        "https://assets.gadgetandgear.com/upload/media/iphone-16-pro-max-512gb-desert-titanium-4.jpeg",
        "https://assets.gadgetandgear.com/upload/media/iphone-16-pro-max-512gb-desert-titanium-5.jpeg"
      ],
      "quantity": 20,
      "rating": 4.8,
      "reviews": 125
    },
    {
      "id": "2",
      "name": "Apple Watch Ultra 2",
      "category": "Wearables",
      "price": 899,
      "short_description": "Designed for adventurers, the Apple Watch Ultra 2 combines rugged durability with advanced features. With its titanium case and sapphire crystal display, it can withstand extreme conditions while maintaining a sleek appearance. ",
      "description": "The Apple Watch Ultra 2 is the ultimate companion for explorers and fitness fanatics. Its rugged titanium chassis and scratch-resistant sapphire crystal face endure harsh environments, from mountain trails to ocean depths. Advanced health sensors provide real-time insights into your heart rate, blood oxygen saturation, and sleep patterns, empowering you to optimize your wellness. The dual-frequency GPS delivers pinpoint accuracy for backcountry navigation, while the 100-meter water resistance makes it ideal for snorkeling and deep-water workouts. With an extended 36-hour battery life, it keeps up with your longest adventures. Whether you're tracking a marathon or diving into open waters, the Ultra 2 combines resilience with smart functionality.",
      "points": [
        "Titanium case and sapphire crystal display for durability",
        "Advanced health monitoring: heart rate, blood oxygen, and sleep tracking",
        "Dual-frequency GPS for precise navigation",
        "Water-resistant up to 100 meters",
        "36-hour battery life on a single charge"
      ],
      "images": [
        "https://img.freepik.com/free-photo/rendering-smart-home-device_23-2151039303.jpg"
      ],
      "quantity": 35,
      "rating": 4.7,
      "reviews": 98
    },
    {
      "id": "3",
      "name": "MacBook Pro 16-inch",
      "category": "Laptops",
      "price": 2799,
      "short_description": "The MacBook Pro 16-inch is a powerhouse laptop designed for professionals and creatives. Powered by the M3 Pro chip, it delivers blazing-fast performance for demanding tasks like video editing, 3D rendering, and software development.",
      "description": "Engineered for creative professionals, the MacBook Pro 16-inch is a marvel of computational power. The M3 Pro chip delivers desktop-class performance, enabling lightning-fast 8K video exports and complex 3D simulations. Its Liquid Retina XDR display brings HDR content to life with breathtaking brightness and true-to-life colors, perfect for color-critical work in photography and film. Configured with up to 64GB of unified memory and 8TB of SSD storage, it handles massive datasets and multitasking with ease. The innovative thermal architecture maintains peak performance during prolonged workloads, while the immersive six-speaker system and studio-quality mics elevate content creation. A true workhorse for developers, editors, and designers.",
      "points": [
        "M3 Pro chip for lightning-fast performance",
        "Liquid Retina XDR display for vibrant colors and high contrast",
        "Up to 64GB RAM and 8TB storage for intensive workflows",
        "Advanced thermal design for sustained performance",
        "Ideal for video editing, 3D rendering, and software development"
      ],
      "images": [
        "https://img.freepik.com/free-photo/laptop-mobile-phone-dark-background-3d-rendering_1142-38685.jpg"
      ],
      "quantity": 15,
      "rating": 4.9,
      "reviews": 154
    },
    {
      "id": "4",
      "name": "Sony WH-1000XM5 Headphones",
      "category": "Audio",
      "price": 399,
      "short_description": "The Sony WH-1000XM5 headphones offer the ultimate noise-canceling experience. Designed for audiophiles, these headphones deliver rich, immersive sound with exceptional clarity. The adaptive noise-canceling technology adjusts to your environment for uninterrupted listening.",
      "description": "Immerse yourself in pristine audio with the Sony WH-1000XM5, the gold standard for noise-canceling headphones. Cutting-edge processors analyze ambient noise 20,000 times per second, creating a silent sanctuary for your music. High-resolution audio drivers reproduce every note with studio-grade accuracy, while DSEE Extreme upscaling revitalizes compressed tracks. The featherlight design and pressure-relieving earpads ensure comfort during long flights or work sessions. Smart features like speak-to-chat automatically pause music during conversations, and multipoint pairing lets you switch between devices effortlessly. With rapid charging and marathon battery life, these headphones are a traveler’s dream and an audiophile’s delight.",
      "points": [
        "Adaptive noise-canceling technology for a seamless experience",
        "Rich, immersive sound with exceptional clarity",
        "Lightweight design with plush ear cushions for comfort",
        "30-hour battery life with quick charging (5 hours in 10 minutes)",
        "Ideal for audiophiles and immersive listening"
      ],
      "images": [
        "https://img.freepik.com/free-photo/still-life-wireless-cyberpunk-headphones_23-2151072186.jpg"
      ],
      "quantity": 50,
      "rating": 4.6,
      "reviews": 112
    },
    {
      "id": "5",
      "name": "Logitech MX Master 3S Mouse",
      "category": "Accessories",
      "price": 99,
      "short_description": "The Logitech MX Master 3S is an ergonomic wireless mouse built for productivity. Its advanced precision sensor works on virtually any surface, including glass. With customizable buttons and a hyper-fast scroll wheel, you can navigate through tasks effortlessly.",
      "description": "Redefine productivity with the Logitech MX Master 3S, engineered for precision and comfort. Its contoured shape supports natural hand positioning, reducing fatigue during marathon work sessions. The 8K DPI sensor tracks flawlessly on glass, wood, or uneven surfaces, while the MagSpeed scroll wheel zips through thousand-line spreadsheets in seconds. Seven customizable buttons and gesture controls put shortcuts at your fingertips, and Flow technology lets you copy-paste across three devices seamlessly. The USB-C charger delivers a full day’s power in just one minute, making it ideal for mobile professionals. A must-have for coders, editors, and multitaskers who demand efficiency.",
      "points": [
        "Ergonomic design reduces hand strain",
        "Advanced precision sensor works on almost any surface",
        "Customizable buttons and hyper-fast scroll wheel",
        "Cross-device control for seamless multitasking",
        "USB-C fast charging with weeks of battery life"
      ],
      "images": [
        "https://imagess.pexels.com/photos/3981749/pexels-photo-3981749.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
      ],
      "quantity": 60,
      "rating": 4.5,
      "reviews": 87
    },
    {
      "id": "6",
      "name": "PlayStation 5 Console",
      "category": "Gaming",
      "price": 499,
      "short_description": "The PlayStation 5 takes gaming to the next level with its ultra-fast SSD and ray tracing technology. Experience stunning 4K graphics and incredibly smooth gameplay at up to 120fps. Its new DualSense controller introduces haptic feedback and adaptive triggers for a more immersive gaming experience.",
     "description": "Step into the future of gaming with the PlayStation 5. Its custom SSD slashes load times to near-instantaneous speeds, while ray tracing and 4K/120Hz output create hyper-realistic worlds. The DualSense controller revolutionizes immersion with tactile haptic feedback and adaptive triggers that simulate bowstrings, triggers, and terrain. Tempest 3D AudioTech envelops you in directional soundscapes, and the sleek two-tone design adds a touch of elegance to your entertainment center. Dive into exclusive titles like *Spider-Man 2* and *Horizon Forbidden West*, or enjoy backward compatibility with PS4 classics. Whether you’re a competitive gamer or a story-driven adventurer, the PS5 delivers next-gen thrills.",
      "points": [
        "Ultra-fast SSD for minimal load times",
        "4K graphics and gameplay up to 120fps",
        "DualSense controller with haptic feedback and adaptive triggers",
        "Sleek design fits into any gaming setup",
        "Exclusive library of must-play games"
      ],
      "images": [
        "https://imagess.pexels.com/photos/7862350/pexels-photo-7862350.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
      ],
      "quantity": 10,
      "rating": 4.9,
      "reviews": 234
    }
  ]
}